Core/src/InformationRegisters/ЦеныНоменклатурыПоКоличество/ЦеныНоменклатурыПоКоличество.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыПоКоличество</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НачальноеКаличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КанечноеКаличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>ЭтотНовыйЗапис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ЦеныНоменклатурыПоКоличество/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Запись.НеИспользуется Тогда 		
		Элементы.Группа3.Доступность = Ложь;				
	КонецЕсли;
		
	ОрганизацияЗаполнена = Не (Запись.Организация = Справочники.Организации.ПустаяСсылка());	
	Если ОрганизацияЗаполнена Тогда
		Возврат;
	КонецЕсли;	
	ОсновнаяОрганизация     = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.Организации.ОсновнаяОрганизация");	
	ОрганизацияПоУмолчанию  = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
	Пользователи.ТекущийПользователь(),
	"ОсновнаяОрганизация");	
	Если ЗначениеЗаполнено(ОрганизацияПоУмолчанию) Тогда	
		Запись.Организация  = ОрганизацияПоУмолчанию;
	Иначе 
		Запись.Организация  = ОсновнаяОрганизация;
	КонецЕсли;
	
	Автор = ПараметрыСеанса.ТекущийПользователь ;	
	Запись.Автор =	Автор ;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	НачальноеКаличество	= Запись.НачальноеКаличество ;
	КанечноеКаличество  = Запись.КанечноеКаличество  ;
	
	//Если (НачальноеКаличество > КанечноеКаличество)Или (НачальноеКаличество = КанечноеКаличество) Тогда 	
	//	ТекстСообщения              =  НСтр("ru = 'Конечное количество должно превышать начальное количество'; ka = 'საბოლოო რაოდენობა უნდა აღემატებოდეს საწყის რაოდენობას!'" );
	//	ЭлементНачальноеКаличество  =  Элементы.НачальноеКаличество;
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ЭлементНачальноеКаличество);
	//	Отказ = Истина ;
	//КонецЕсли;	
	
	Если Запись.ЭтотНовыйЗапис  Тогда 
		
		ВходитДиапазон = Ложь ;
		СтруктураПараметров = Новый Структура ;
		СтруктураПараметров.Вставить ("Дата",Запись.Период);
		СтруктураПараметров.Вставить ("Номенклатура",Запись.Номенклатура);
		СтруктураПараметров.Вставить ("Организация",Запись.Организация);
		СтруктураПараметров.Вставить ("НачальноеКаличество",Запись.НачальноеКаличество);
		СтруктураПараметров.Вставить ("КанечноеКаличество",Запись.КанечноеКаличество);
		СтруктураПараметров.Вставить ("ВидЦен", Запись.ВидЦен );
		СтруктураПараметров.Вставить ("Характеристика", Запись.Характеристика );
		
		ВходитДиапазон = ПроверкаДиапазонаНачальноеКаличество(СтруктураПараметров);
		
		Если ВходитДиапазон Тогда 	
			ТекстСообщения              =  НСтр("ru = ''; ka = ' საწყისი რაოდენობის მონაცემის ჩაწერა არ შეიძლება.მოცემული რაოდენობა უკვე მითითებულია აქტიურ ჩანაწერებში!'" );
			ЭлементНачальноеКаличество  =  Элементы.НачальноеКаличество;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ЭлементНачальноеКаличество);
			Отказ = Истина ;
			Возврат ;
		КонецЕсли;
		
		Если  КанечноеКаличество<> 0 Тогда 
			ВходитДиапазон = ПроверкаДиапазонаКанечноеКаличество(СтруктураПараметров);
			Если ВходитДиапазон Тогда 	
				ТекстСообщения              =  НСтр("ru = ''; ka = ' საწყისი რაოდენობის მონაცემის ჩაწერა არ შეიძლება.მოცემული რაოდენობა უკვე მითითებულია აქტიურ ჩანაწერებში!'" );
				ЭлементКанечноеКаличество  =  Элементы.КанечноеКаличество;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ЭлементКанечноеКаличество);
				Отказ = Истина ;
				Возврат ;
			КонецЕсли;
		КонецЕсли;

		Если  КанечноеКаличество = 0 Тогда 	
			ВходитДиапазон = ПроверкаДиапазонаКанечноеКаличествоНаНолл(СтруктураПараметров);
			Если  ВходитДиапазон Тогда 
				ТекстСообщения              =  НСтр("ru = ''; ka = 'საბოლოო რაოდენობის მონაცემი - 0 უკვე მითითებულია სხვა ჩანაწერში.მსგავსი მონაცემების ჩაწერა არარეკომენდებულია.გადაამოწმეთ არსებული დიაპაზონები !'" );
				ЭлементКанечноеКаличество  =  Элементы.КанечноеКаличество;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ЭлементКанечноеКаличество);
				Отказ = Истина ;
				Возврат ;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
	 Запись.ЭтотНовыйЗапис = Ложь ;
	
КонецПроцедуры


#Область ОбработчикиСобытийЭлементовФормы


&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	СтруктураДанных = ПолучитьДанныеНоменклатураПриИзменении(Запись.Номенклатура);
	Запись.ЕдиницаИзмерения = СтруктураДанных.ЕдиницаИзмерения;
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.

Функция ПолучитьДанныеНоменклатураПриИзменении(Номенклатура)
	
	Возврат Новый Структура("ЕдиницаИзмерения, ИспользоватьХарактеристики", Номенклатура.ЕдиницаИзмерения);
	
КонецФункции


&НаСервере
Функция ПроверкаДиапазона(СтруктураПараметров)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Период,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Организация,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Характеристика,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.НачальноеКаличество,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.КанечноеКаличество,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.ЕдиницаИзмерения,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.ВидЦен
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыПоКоличество.СрезПоследних(, Период = &Дата) КАК ЦеныНоменклатурыПоКоличествоСрезПоследних
	|ГДЕ
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Организация = &Организация
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.Номенклатура = &Номенклатура
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.Характеристика = &Характеристика
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.ВидЦен = &ВидЦен";
	
	Запрос.УстановитьПараметр("Дата", СтруктураПараметров.Дата);
	Запрос.УстановитьПараметр("Номенклатура", СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("Характеристика", СтруктураПараметров.Характеристика);
	Запрос.УстановитьПараметр("ВидЦен", СтруктураПараметров.ВидЦен);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из  РезультатЗапроса Цикл 
		
		Если (СтруктураПараметров.НачальноеКаличество>= Стр.НачальноеКаличество) И 
			 (СтруктураПараметров.НачальноеКаличество< Стр.КанечноеКаличество)  Тогда
			 
			//(СтруктураПараметров.КанечноеКаличество<= Стр.КанечноеКаличество) Тогда 
			ВходитДиапазон = Истина;
			Возврат  ВходитДиапазон;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат  ВходитДиапазон = Ложь ;

КонецФункции 


&НаСервере
Функция ПроверкаДиапазонаНачальноеКаличество(СтруктураПараметров)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Период,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Организация,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Характеристика,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.НачальноеКаличество,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.КанечноеКаличество,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.ЕдиницаИзмерения,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Характеристика КАК Характеристика1,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.ВидЦен
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыПоКоличество.СрезПоследних(, Период = &Дата) КАК ЦеныНоменклатурыПоКоличествоСрезПоследних
	|ГДЕ
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Организация = &Организация
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.Номенклатура = &Номенклатура
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.НеИспользуется = ЛОЖЬ
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.Характеристика = &Характеристика
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.ВидЦен = &ВидЦен";
	
	Запрос.УстановитьПараметр("Дата", СтруктураПараметров.Дата);
	Запрос.УстановитьПараметр("Номенклатура", СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("Характеристика", СтруктураПараметров.Характеристика);
	Запрос.УстановитьПараметр("ВидЦен", СтруктураПараметров.ВидЦен);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из  РезультатЗапроса Цикл 
		
		Если (СтруктураПараметров.НачальноеКаличество>= Стр.НачальноеКаличество) И 
			 (СтруктураПараметров.НачальноеКаличество< Стр.КанечноеКаличество)  Тогда
			  
			ВходитДиапазон = Истина;
			Возврат  ВходитДиапазон;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат  ВходитДиапазон = Ложь ;

КонецФункции 


&НаСервере
Функция ПроверкаДиапазонаКанечноеКаличество(СтруктураПараметров)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Период,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Организация,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Характеристика,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.НачальноеКаличество,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.КанечноеКаличество,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.ЕдиницаИзмерения,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.ВидЦен
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыПоКоличество.СрезПоследних(, Период = &Дата) КАК ЦеныНоменклатурыПоКоличествоСрезПоследних
	|ГДЕ
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Организация = &Организация
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.Номенклатура = &Номенклатура
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.НеИспользуется = ЛОЖЬ
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.ВидЦен = &ВидЦен
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Дата", СтруктураПараметров.Дата);
	Запрос.УстановитьПараметр("Номенклатура", СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("Характеристика", СтруктураПараметров.Характеристика);
	Запрос.УстановитьПараметр("ВидЦен", СтруктураПараметров.ВидЦен);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из РезультатЗапроса Цикл 
		
		Если (СтруктураПараметров.КанечноеКаличество >= Стр.НачальноеКаличество) И 
			 (СтруктураПараметров.КанечноеКаличество<= Стр.КанечноеКаличество)  Тогда
			  
			ВходитДиапазон = Истина;
			Возврат  ВходитДиапазон;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат  ВходитДиапазон = Ложь ;

КонецФункции 

&НаСервере
Функция ПроверкаДиапазонаКанечноеКаличествоНаНолл(СтруктураПараметров)
	
	ВходитДиапазон = Ложь ;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Период,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Организация,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Характеристика,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.НачальноеКаличество,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.КанечноеКаличество,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.ЕдиницаИзмерения,
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.ВидЦен
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыПоКоличество.СрезПоследних(, Период = &Дата) КАК ЦеныНоменклатурыПоКоличествоСрезПоследних
	|ГДЕ
	|	ЦеныНоменклатурыПоКоличествоСрезПоследних.Организация = &Организация
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.Номенклатура = &Номенклатура
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.НеИспользуется = ЛОЖЬ
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.КанечноеКаличество = 0
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.Характеристика = &Характеристика
	|	И ЦеныНоменклатурыПоКоличествоСрезПоследних.ВидЦен = &ВидЦен";
	
	Запрос.УстановитьПараметр("Дата", СтруктураПараметров.Дата);
	Запрос.УстановитьПараметр("Номенклатура", СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("Характеристика", СтруктураПараметров.Характеристика);
	Запрос.УстановитьПараметр("ВидЦен", СтруктураПараметров.ВидЦен);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	
	Если РезультатЗапроса.Количество()> 0 тогда 
		
		ВходитДиапазон = Истина ;
			
	КонецЕсли;
			
	Возврат  ВходитДиапазон  ;

КонецФункции 



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	   //а =  Запись.ЭтотНовыйЗапис ;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	    Запись.ЭтотНовыйЗапис = Ложь ; 
	
КонецПроцедуры


&НаКлиенте
Процедура НачальноеКаличествоПриИзменении(Элемент)
	
	
		ВходитДиапазон = Ложь ;
		СтруктураПараметров = Новый Структура ;
		СтруктураПараметров.Вставить ("Дата",Запись.Период);
		СтруктураПараметров.Вставить ("Номенклатура",Запись.Номенклатура);
		СтруктураПараметров.Вставить ("Организация",Запись.Организация);
		СтруктураПараметров.Вставить ("НачальноеКаличество",Запись.НачальноеКаличество);
		СтруктураПараметров.Вставить ("КанечноеКаличество",Запись.КанечноеКаличество);
		СтруктураПараметров.Вставить ("Характеристика",Запись.Характеристика);
		СтруктураПараметров.Вставить ("ВидЦен",Запись.ВидЦен);
		
		ВходитДиапазон = ПроверкаДиапазонаНачальноеКаличество(СтруктураПараметров);
		Если ВходитДиапазон Тогда 	
			ТекстСообщения              =  НСтр("ru = ''; ka = 'საწყისი რაოდენობის მონაცემის ჩაწერა არ შეიძლება.მოცემული რაოდენობა უკვე მითითებულია აქტიურ ჩანაწერებში!'" );
			ЭлементНачальноеКаличество  =  Элементы.НачальноеКаличество;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ЭлементНачальноеКаличество);
			//Отказ = Истина ;
		КонецЕсли;

	  
КонецПроцедуры

&НаКлиенте
Процедура КанечноеКаличествоПриИзменении(Элемент)
	
		ВходитДиапазон = Ложь ;
		СтруктураПараметров = Новый Структура ;
		СтруктураПараметров.Вставить ("Дата",Запись.Период);
		СтруктураПараметров.Вставить ("Номенклатура",Запись.Номенклатура);
		СтруктураПараметров.Вставить ("Организация",Запись.Организация);
		СтруктураПараметров.Вставить ("НачальноеКаличество",Запись.НачальноеКаличество);
		СтруктураПараметров.Вставить ("КанечноеКаличество",Запись.КанечноеКаличество);
		СтруктураПараметров.Вставить ("Характеристика",Запись.Характеристика);
		СтруктураПараметров.Вставить ("ВидЦен",Запись.ВидЦен);
		
		ВходитДиапазон = ПроверкаДиапазонаКанечноеКаличество(СтруктураПараметров);
		Если ВходитДиапазон Тогда 	
			ТекстСообщения              =  НСтр("ru = ''; ka = 'საბოლოო რაოდენობის მონაცემის ჩაწერა არ შეიძლება.მოცემული რაოდენობა უკვე მითითებულია აქტიურ ჩანაწერებში!'" );
			ЭлементКанечноеКаличество  =  Элементы.КанечноеКаличество;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ЭлементКанечноеКаличество);
			//Отказ = Истина ;
		КонецЕсли;
КонецПроцедуры


#КонецОбласти
